Revit 2023 API
ExternallyTaggedNonBRep Members
The ExternallyTaggedNonBRep type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBRep
 Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Methods
Name | Description
Dispose |  (Inherited from ExternallyTaggedGeometryObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ExternalId
 The external Id of the geometry object.
 (Inherited from ExternallyTaggedGeometryObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ExternallyTaggedGeometryObject.)
See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace